all/.local/bin/gitrelease
#!/usr/bin/env bash
# “gitrelease”: first working cut (Pandoc + Pied)

# [[file:../../../gitreleases.org::*“gitrelease”: first working cut (Pandoc + Pied)][“gitrelease”: first working cut (Pandoc + Pied):1]]
#!/usr/bin/env bash
set -Eeuo pipefail

# Simple per-app config lives here (one file per app)
CONF_DIR="${XDG_CONFIG_HOME:-$HOME/.config}/gitrelease.d"
DL_DIR="${XDG_CACHE_HOME:-$HOME/.cache}/gitrelease"
APPIMG_DIR="$HOME/Applications"

mkdir -p "$CONF_DIR" "$DL_DIR" "$APPIMG_DIR"

require() { command -v "$1" >/dev/null 2>&1 || { echo "Missing: $1" >&2; exit 2; }; }

# --- helpers ---------------------------------------------------------------

# curl JSON of latest release; unauthenticated works, GH_TOKEN optional to lift rate limits
gh_latest_json() {
  local repo="$1"
  local url="https://api.github.com/repos/$repo/releases/latest"
  if [[ -n "${GH_TOKEN:-}" ]]; then
    curl -fsSL -H "Authorization: Bearer $GH_TOKEN" "$url"
  else
    curl -fsSL "$url"
  fi
}

json_asset_url() {
  # $1=json $2=regex -> first matching asset url
  jq -r --arg re "$2" '.assets[].browser_download_url | select(test($re))' <<<"$1" | head -n1
}

normalize_ver() { sed -E 's/^v//' <<<"$1"; }

deb_installed_ver() {
  # $1=package name, returns version or empty
  dpkg-query -W -f='${Version}\n' "$1" 2>/dev/null || true
}

appimage_current_ver() {
  # crude: parse "name-x.y.z-x86_64.AppImage" in ~/Applications
  local name="$1"
  ls "$APPIMG_DIR"/"$name"-*.AppImage 2>/dev/null | sed -nE "s#^.*${name}-([^-]+).*.AppImage#\1#p" | sort -V | tail -n1
}

flatpak_installed_ver() {
  # $1=app id
  flatpak info "$1" 2>/dev/null | awk -F': *' '/^Version:/ {print $2}'
}

download() {
  local url="$1"
  local out="$DL_DIR/$(basename "$url")"
  curl -fL "$url" -o "$out"
  echo "$out"
}

# --- verbs -----------------------------------------------------------------
usage() {
  cat <<EOF
Usage:
  gitrelease list
  gitrelease update <app>
  gitrelease update-all
Apps are defined as conf files in: $CONF_DIR
EOF
}

list_apps() { ls "$CONF_DIR"/*.conf 2>/dev/null | xargs -n1 basename | sed 's/\.conf$//'; }

update_one() {
  local app="$1" conf="$CONF_DIR/$1.conf"
  [[ -r "$conf" ]] || { echo "No config for $app ($conf)"; return 1; }
  # shellcheck disable=SC1090
  source "$conf"

  # required vars from conf: NAME, REPO, TYPE, ASSET_RE, (DEB_PKG|FLATPAK_ID|APPIMG_NAME)
  : "${NAME:?}"; : "${REPO:?}"; : "${TYPE:?}"; : "${ASSET_RE:?}"

  require jq curl

  json="$(gh_latest_json "$REPO")"
  latest_tag="$(jq -r '.tag_name' <<<"$json")"
  latest_ver="$(normalize_ver "$latest_tag")"
  asset_url="$(json_asset_url "$json" "$ASSET_RE")"

  [[ -n "$asset_url" ]] || { echo "No asset matched for $NAME ($ASSET_RE)"; return 1; }

  case "$TYPE" in
    deb)
      : "${DEB_PKG:?}"
      have="$(deb_installed_ver "$DEB_PKG")"
      if [[ -n "$have" && "$(dpkg --compare-versions "$have" ge "$latest_ver"; echo $?)" -eq 0 ]]; then
        echo "[deb] $NAME is up-to-date ($have >= $latest_ver)"; return 0
      fi
      f="$(download "$asset_url")"
      sudo dpkg -i "$f"
      echo "[deb] Installed $NAME $latest_ver from $f"
      ;;
    flatpak)
      : "${FLATPAK_ID:?}"
      require flatpak
      have="$(flatpak_installed_ver "$FLATPAK_ID")"
      if [[ -n "$have" && "$(printf '%s\n%s\n' "$have" "$latest_ver" | sort -V | tail -n1)" == "$have" ]]; then
        echo "[flatpak] $NAME is up-to-date ($have >= $latest_ver)"; return 0
      fi
      f="$(download "$asset_url")"
      flatpak install -y --user --bundle "$f"
      echo "[flatpak] Installed $NAME $latest_ver from $f"
      ;;
    appimage)
      : "${APPIMG_NAME:?}"
      have="$(appimage_current_ver "$APPIMG_NAME")"
      if [[ -n "$have" && "$(printf '%s\n%s\n' "$have" "$latest_ver" | sort -V | tail -n1)" == "$have" ]]; then
        echo "[appimage] $NAME is up-to-date ($have >= $latest_ver)"; return 0
      fi
      f="$(download "$asset_url")"
      chmod +x "$f"
      dest="$APPIMG_DIR/$APPIMG_NAME-$latest_ver.AppImage"
      mv -f "$f" "$dest"
      ln -sf "$dest" "$APPIMG_DIR/$APPIMG_NAME-latest.AppImage"
      echo "[appimage] Installed $NAME $latest_ver → $dest"
      ;;
    *)
      echo "Unknown TYPE: $TYPE"; return 1;;
  esac
}

case "${1:-}" in
  list) list_apps ;;
  update) shift; update_one "${1:?app}";;
  update-all)
    ok=0; for a in $(list_apps); do update_one "$a" || ok=1; done; exit $ok;;
  *) usage; exit 1;;
esac
# “gitrelease”: first working cut (Pandoc + Pied):1 ends here
